# Задание 7:
# Створити class Коло (Circule), який би мав:
# ---> конструктор, що задає його радіус та координати центру
# ---> метод __str__ для перетворення на рядок для використання у функції print
# ---> метод для обчислення площі
# ---> метод для обчислення довжини кола
# ---> метод, який би повертав діаметр
# ---> метод, який би обчислював площу сектора, який задається кутом
# ---> метод, який би обчислював довжину дуги, яка задається кутом
# ---> метод який би визначав, чи перетинається дане коло з іншим колом

from math import pi, sqrt

def dist(x1, y1, z1, x2, y2, z2): # расстояние между двумя точками
    return sqrt ((x1 - x2)**2 + (y1 - y2)**2 + (z1 - z2)**2)

class Rectangle:
    ''' Класс "Окружность" '''
    
    def __init__(self, x, y):
        '''Создание новой окружности.'''
        self.width = x
        self.height = y

    def __init__(self, other):
        self.width = other.width
        self.height = other.height
        
    def __str__(self):
        '''Вывод координат x, y, z и радиуса окружности.'''
        return "Окружность с координатами ({0}, {1})".format(self.width, self.height)

    def diag(self):
        return sqrt(self.width ** 2 + self.height ** 2)

    def copy_from_other(self, other):
        '''конструктор копии, принимающий в качестве параметра ссылку на объект класса «Прямоугольник», и создающий прямоугольник со сторонами, равными диагонали копируемого объекта.'''
        self.width = other.diag()
        self.height = other.diag()




















        
