# Донченко, лаба 6, ФЕ-3106

import random
import sys

while True:

    # Размер дальнейшего списка
    SizeOfArray=input('Введіть розмір подальшого списку - кількість елементів у ньому: ')

    # На случай, если не введено ничего
    while SizeOfArray=='':
        SizeOfArray=input('Введіть розмір подальшого списку - кількість елементів у ньому: ')
    SizeOfArray=int(SizeOfArray)
    # На случай, если введено целое, но отрицательное
    while SizeOfArray<0:
        SizeOfArray=input('Введіть розмір подальшого списку - кількість елементів у ньому: ')
        while SizeOfArray=='':
            SizeOfArray=input('Введіть розмір подальшого списку - кількість елементів у ньому: ')

    # наш список
    List=[]

    # если длина списка 0 (пустой), то...
    if SizeOfArray==0:
        print('список порожній')
        sys.exit()

    # вот (*), аппенд - добавляет к списку последний элемент
    # и каждый раз на единичку больше
    for k in range(1, SizeOfArray+1):
        z=(random.randint(-1000, 1000)) # работа random'a только с целыми числами
        print('Додано елемент', z)
        List.append(z) 

    # делаем бекап нашего списка
    ListBackup=list(List)
    print ('')
    print ('Отримано список:')
    print (ListBackup)

    # сортируем по убыванию(по возрастанию+перевернуть), 1эл будет максимальным
    List.sort()
    List.reverse()
    print('Цей список у порядку спадання')
    print(List)

    while True:
        print()
        # вот он, тот самый Х, наличие которого проверяется
        x_str=input('Введіть число, наявність якого ви перевіряєте: ')
        if x_str=='STOP':
            break
        while x_str=='':
            x_str=input('Введіть число, наявність якого ви перевіряєте: ')
        x=float(x_str)
    
        # если макс. элемент списка меньше введенного Х, то  
        if List[0]<x:
            print('Число', x_str, 'більше за кожне з чисел зі списку')

        # если мин. элемент списка больше введенного Х, то  
        elif List[-1]>x:
            print('Число', x_str, 'менше за кожне з чисел зі списку')
    
        #######################
        else:               # бинарный поиск #
        #######################

            i = 0 # первый элемент
            j = len(List)-1 # последний элемент
            m = int(j / 2) # середина (приблизительно)
 
            # пока искомое значение не равно текущей середине
            # или левая граница зашла за правую (элемент не найден)
        
            while List[m]!=x and i <= j: 
                if x > List[m]: # если значение больше серединного(левая половина)
                    j = m-1 # то сместить правую границу за середину
                    m = int(j/2)
                elif x < List[m]: # справа от середины
                    i = m+1 # переместить левую границу до середины
                    m = int((i+j) / 2) # найти новую середину
    
            k=0 # обнуляем переменную К
            if i > j:
                print('Числа ', x_str, 'нема')
            else:
                while x!=ListBackup[k]:
                    k+=1
                print ('Число', x_str, 'є, у початковому списку воно має індекс: ', k)
                print ('Число', x_str, 'у списку за спаданням має індекс: ', m)

    print()
    Active=input('Повторить программу?    ')
    if Active=='нет' or Active=='no' or Active=='ні':
        break
