# Заготовка - создание списка из случайных элементов

import random
import sys

# Размер дальнейшего списка
SizeOfArray=input('Введіть розмір подальшого списку - кількість елементів у ньому: ')

# На случай, если не введено ничего
while SizeOfArray=='':
    SizeOfArray=input('Введіть розмір подальшого списку - кількість елементів у ньому: ')
SizeOfArray=int(SizeOfArray)
# На случай, если введено целое, но отрицательное
while SizeOfArray<0:
    SizeOfArray=input('Введіть розмір подальшого списку - кількість елементів у ньому: ')
    while SizeOfArray=='':
        SizeOfArray=input('Введіть розмір подальшого списку - кількість елементів у ньому: ')

# наш список
List=[]

# если длина списка 0 (пустой), то...
if SizeOfArray==0:
    print('список порожній')
    sys.exit()

# аппенд - добавляет к списку на последнюю позицию элемент
for k in range(1, SizeOfArray+1):
    z=(random.randint(-1000, 1000)) # работа random'a только с целыми числами
    print('Додано елемент', z)
    List.append(z) 
