# 1) Дано натуральне число N.
# Отримати всі прості дільники цього числа.

from math import sqrt

n_str=input('Введіть натуральне досліджуване число N: ')
while n_str=='' : # на случай ввода пустого значения
    n_str=input('Введіть натуральне досліджуване число N: ')
n_float=float(n_str)
n=int(n_float) # натуральное Н, значит пользуемся интом
while n_float-int(n_float)!=0 or n_float<1: # отсев ненатуральных чисел
    n_str=input('Введіть натуральне досліджуване число N: ')
    while n_str=='' : # на случай ввода пустого значения
        n_str=input('Введіть натуральне досліджуване число N: ')
    n_float=float(n_str)
    n=int(n_float) # натуральное Н, значит пользуемся интом
    

k=2
i=2
ls='' # итоговый список

if n==1:
    print ('Простих дільників у числа ', n_str, 'немає')
else:
    while k<=n:
        if n%k==0: # является ли по очереди каждое число делителем
            if i<=sqrt(k):
                while i<=sqrt(k): # и если да, то простое ли оно
                    if k%i==0:
                        break
                    i+=1
                if k%i!=0:
                    ls+=str(k)+', ' # если простое, то вносим его в итоговый список
                i=2
            else:
                ls+=str(k)+', ' # кстати, вносим с сепаратором в виде запятой ","
        k+=1
    print('Всі прості дільники числа ', n_str, ':')            
    print(ls)
